########################################################游戏名称：秋水落霞######################################################################
###################################################最终解释权归美丽可爱630所有##################################################################
#游戏中的人物设定有：
#主角：秋霞（也称公子）  陆美丽（性格：温柔） 陆可爱 （性格：活泼）  柒七
#配角：丫鬟 陆员外
#说明：此游戏为美丽可爱630分工协作完成，感谢每一位的倾情付出。具体分工为杨德元和史梦欣构思的剧本，最终由杨德元编写完成；韦秋霞编写的为场景0和场景4；钱碧平编写的为场景1和场景3；刘彤编写的为场景2和场景5；史梦欣编写的为计分和结局；王丽负责将整个故事串起来和后期美化修改；杨德元负责为大家展示我们的成果；最后感谢韦秋霞为我们解决编写中出现的疑难问题以及整个编写过程中大家的协同帮助。如有任何问题，欢迎和我们交流。
#!/usr/bin/perl
use warnings;
print `clear`;

#初始化kahgd(可爱好感度),mlhgd(美丽好感度),qqhgd(柒七好感度)。
my $kahgd = 0;
my $mlhgd = 0;
my $qqhgd = 0;

#场景0，此部分为韦秋霞所编写。
sub countine {
    $con = <STDIN>;
    unless ( $con =~ /\n+/ ) {
        print "error";
    }
    print `clear`;
}
print
"～(￣▽￣～)(～￣▽￣)～～(￣▽￣～)(～￣▽￣)～～(￣▽￣～)(～￣▽￣)～～(￣▽￣～)(～￣▽￣)～～(￣▽￣～)(～￣▽￣)～\n";
print
"✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿  美丽可爱630出品 ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿ ✿  \n\n";
print
"This game is called '秋水落霞'，do you want to play it???\nIf you want to,please enter Y, or enter other keys to quit.\n";
openning();

sub openning {
    $enter = <STDIN>;
    chomp $enter;
    if ( $enter =~ /\s*y/i ) {
        print
"\n乙未年初，天岁城郊。书生某秋霞进京赶考，☂☂偶遇大雨☂☂，遂染疾。陆员外本性善良，偶见书生面相温和儒雅，遂携书生归。\n";
        print "please enter 'Enter' to continue:\n";
        countine();
        print '
 ❀ ❀ 陆家 ❀ ❀   
               /     \
   |           | (       ) |           |
  /^\ |       /^\ \     / /^\       | /^\
  |O|/^\     (   )|-----|(   )     /^\|O|
  |_||-| |^-^|---||-----||---|^-^| |-||_|
  |O||O| |/^\|/^\||  |  ||/^\|/^\| |O||O|
  |-||-| ||_|||_||| /^\ |||_|||_|| |-||-|
  |O||O| |/^\|/^\||(   )||/^\|/^\| |O||O|
  |-||-| ||_|||_||||   ||||_|||_|| |-||-| 
';
        print "\n\nplease enter 'Enter' to continue:";
        countine();
        print "
秋霞：(ﾟДﾟ≡ﾟДﾟ)这是哪里？
丫鬟：♪(＾∀＾●)ﾉ公子醒了？这是天岁陆府，老爷出门见你晕倒在路边，带你回家歇息养病。
陆员外：公子醒了，身体可好些？ 
秋霞：多谢陆老，已经无恙。晚生应尽快赶路，以免错过考试。待晚生可靠回来定会感谢陆老。  ○|￣|_\n";
        print
"陆员外：嗨，公子莫急。可在休养几日，老夫可派人送公子入京。
(now, you have to choose.Do you want to choose A or B?)
  A：那晚生有礼了
  B：陆老好意我心领了。然而近日给您平添诸多不便，不应继续打扰，晚生告辞。\n";
        print "You choose：";
        do {
            $choose = '';
            you_choose($choose);
            if ( $choose =~ /[Aa]/ ) {
                print
"\n(o゜▽゜)o☆ [BINGO!](游戏继续）\n\nplease enter 'Enter' to continue:\n";
            }
            elsif ( $choose =~ /[Bb]/ ) {
                print
"\n☹ ☹ ☹ ☹ ☹ game over(☄⊙ ω⊙)☄\n\n你身体并未痊愈，病死在路上。(让你不认真选，重新玩呗)∑^)/∑^)/∑^)/∑^)/\n\n";
                exit;
            }
            else { print "你打的什么鬼，重新输入\n"; }
        } until ( $choose =~ /[AaBb]/ );
    }
    else {
        print
"ค(TㅅT) byebye......\n真的不想来玩吗？要不要重新来一次(,,• ₃ •,,)\n\n";
        exit;
    }
}
you_choose();

sub you_choose {
    $choose = <STDIN>;
    chomp $choose;
    return $choose;
}

#场景1，此部分为钱碧平所编写。
my $your_choice;
print
"你安心在陆府休养。有一天突然听到外面有人在聊天，一个姑娘说话柔柔弱弱的，另一个听声音就很是活泼。想来这就是陆员外之前和你提到过的家中的两个女儿了叭。\n";
print
"过了一会谈话的声音就消失了，想来这几日一直修养，身体渐好，你决定出去走走。你决定去哪里呢?\n";
print
"选择有\n A:陆家庭院,\n B:陆府后山的竹林,\n C:出门去集市逛逛\n";
print "\n你的选择是：";

#print "$choices\n";
do {
    $your_choice = '';
    $your_choice = <STDIN>;
    chomp $your_choice;
    if ( $your_choice eq 'a' || $your_choice eq 'A' ) {
        print `clear`;
        print
"\n你走到庭院，听到了一阵愉快的笑声。走进一看，一个女孩正在修剪盆栽。\n";
        print
" 陆可爱：公子身体好了？\n 秋霞：已经痊愈了，谢姑娘关心。想来姑娘就是陆老的小女儿吧。这些盆栽都是姑娘修剪的？\n陆可爱：是啊，我平时最喜欢打理这些花花草草了，爹爹总说不像个姑娘家。我姐姐美丽比我温柔多了，姐姐还会写诗呢~隔壁的柒七姑娘也会经常和我们在一起玩，柒七总是有很多新奇的小玩意。\n秋霞：谁说不像姑娘家。这样的性子也很好啊~ \n丫鬟：小姐，老爷叫你去练舞了。\n可爱：公子，那我先走了\n";

        #可爱好感度+1
        $kahgd = $kahgd + 1;
    }
    elsif ( $your_choice eq 'B' || $your_choice eq 'b' ) {
        print `clear`;
        print
"你走到陆府后山的竹林，看到一个女子正在抚琴，轻轻唱着一首婉转的歌。\n陆美丽：公子身体好了？\n 秋霞：已经痊愈了，谢姑娘关心。想来姑娘就是陆老的大女儿吧。姑娘刚才唱的歌真是好听\n陆美丽：是我闲来无事写来的词，让公子见笑了。公子，我约了柒七出门，先告辞了\n秋霞：柒七？\n陆美丽：柒七是隔壁柒家的小姐，平时经常和我们姐妹一起玩。柒七新奇的小玩意可多了。公子我先告辞了。可爱应该正在院子里修剪花木或是练舞，如果公子无事可否去指点一下妹妹？\n";

        #美丽好感度+1
        $mlhgd = $mlhgd + 1;
    }
    elsif ( $your_choice =~ /[Cc]/ ) {
        print `clear`;
        print
"\n你走出陆府，突然被一个姑娘撞到，险些跌倒.\n柒七：喂，走路不长眼啊。诶？陆府不是只有美丽可爱姐妹么，你为什么进陆府？\n秋霞：我进京赶考的路上染病，陆老带我回家休养\n柒七：哦，原来是这样，我是隔壁柒家的小姐，我叫柒七。正要去找美丽可爱姐姐，美丽姐姐平日最喜欢吟诗作画了，可爱姐姐平日总是打理院子里的花草树木，而且可爱姐姐跳舞特别棒。这个东西你会弄么？\n你低头一看，柒七手里拿着一个奇怪的小盒子。拿过来一看，原来是个有机关的小盒子，你仔细观察了一会，很快就打开了。\n柒七：公子这么厉害。教我好不好\n秋霞：这个是有秘诀的……………………（此处省略一千字）\n";

        #柒七好感度+1
        $qqhgd = $qqhgd + 1;
    }
    else { print "打的什么鬼,重新输入"; }
} until ( $your_choice =~ /[ABCabc]/ );

#场景2，此部分为刘彤所编写。
print "please enter 'Enter' to continue:\n";
$input = <STDIN>;
unless ( length($input) == 1 and chomp($input) ) {
    print
"别闹！还要不要勾搭妹子！请重新输入（Please enter 'Enter' to continue.）\n";
    $input = <STDIN>;
}
print
"你安心在陆府休养,身体很快就痊愈了\n一日，陆员外想去镇上买些古玩装饰书房，想到你学识渊博，于是便邀请你一同前往~~~~\n";
print
"路上，遇到了一户人家正在娶亲，从未经历过迎亲的你不由多看了几眼。...\n ";
print ' ❀ ❀ 婚礼 ❀ ❀
 /( )\    ( )
/ / \ \  / : \
~~\%/~~  \|:|/
 /   \    |||
/,,,,,\   |||';
print "\n\nplease enter 'Enter' to continue:";
countine();
print
"\n陆员外:公子家境如何？可否成亲啊？ '(๑•̀ㅂ•́)و✧' \n";
print
"秋霞：家中小本生意，并非大户人家，至今未有意中人。'ㄟ( ▔, ▔ )ㄏ'\n";
print
"陆员外：那公子可有中意的姑娘，或是喜欢什么性格的姑娘？'(　ﾟ∀ﾟ) ﾉ♡'\n";
print
"A.如果有温柔的姑娘，平日吟诗作画，岂不是人生乐事？\nB.如果有活泼的姑娘，我抚琴她跳舞，想想真是良辰美景Ｏ（∩＿∩）Ｏ\nC.我喜欢奇奇怪怪的小玩意，如果有姑娘也喜欢这个真是极好的（＊＾＿＿＾＊）\n\n";
print "你的选择是：";
do {
    $choose = '';
    you_choose();

    if    ( $choose =~ /[Aa]/ ) { $mlhgd = $mlhgd + 1; }
    elsif ( $choose =~ /[Bb]/ ) { $kahgd = $kahgd + 1; }
    elsif ( $choose =~ /[Cc]/ ) { $qqhgd = $qqhgd + 1; }
    else { print "你打的什么鬼，请重新输入"; }
} until ( $choose =~ /[ABCabc]/ );

#场景3，此部分为钱碧平所编写。
print `clear`;
print
"\n某一日，你用过午膳打算回自己房间休息。突然看到迎面匆匆走来的三姐妹.\n打过招呼后，美丽好似有心事，你正欲问一问有什么事情，可爱开口道\n公子，过几日就是爹爹的生日了，我们各自准备了礼物，但是总觉得不是那么满意。公子博学多才，能否帮我们修改一下呢?\n原来是这么简单的事情，你一口应下。午觉过后，你拿出了三姐妹准备的礼物。分别是一首词，一盆精心修剪的盆栽，一个奇奇怪怪的小装饰。你决定先修改哪一件呢？\n";
print
"选择有:\nA 奇奇怪怪的小装饰 \nB 那首词 \nC 修剪过的盆栽\n";

do {
    $your_choice = '';
    $your_choice = <STDIN>;
    chomp $your_choice;
    if ( $your_choice eq 'a' || $your_choice eq 'A' ) {
        $qqhgd = $qqhgd + 1;
    }
    elsif ( $your_choice eq 'B' || $your_choice eq 'b' ) {
        $mlhgd = $mlhgd + 1;
    }
    elsif ( $your_choice =~ /[Cc]/ ) {
        $kahgd = $kahgd + 1;
    }
    else { print "你打的什么鬼，重新输入"; }
} until ( $your_choice =~ /[ABCabc]/ );

#场景4，此部分为韦秋霞所编写。
print
"\n\n又过了几日，到了陆员外的生日，天岁城很多大户人家都前来祝寿。说是过生日，倒不如说是趁这个机会选婿，自然，隔壁柒家小姐的亲事也是陆员外时刻惦记着的。到场的各家公子纷纷拿出贺礼，陆家小姐和柒家小姐好似并不感兴趣。你打算送陆员外什么贺礼呢？\n
A：今日是陆老生日，晚生略懂书法，献上自己的诗一首，陆老不要嫌弃。
B：陆老的生日，自然应该欢欢乐乐的。听闻陆家二小姐尤擅舞，碰巧晚生略通音律，不如我抚琴一曲为可爱小姐伴奏可好？
C：想来各种古玩陆老已经不稀罕，晚生略通机关，这是晚生亲手做的箱子，其中运用了机关之术，其他人绝对无法打开。陆老可用来收藏珍贵物品。\n";
do {
    $choose = '';
    you_choose();
    if    ( $choose =~ /[Aa]/ ) { print `clear`; $mlhgd = $mlhgd + 1; }
    elsif ( $choose =~ /[Bb]/ ) { print `clear`; $kahgd = $kahgd + 1; }
    elsif ( $choose =~ /[Cc]/ ) { print `clear`; $qqhgd = $qqhgd + 1; }
    else                        { print "打的什么鬼，请重新输入"; }
} until ( $choose =~ /[ABCabc]/ );

#场景5，此部分为刘彤所编写。
print
"φ(゜▽゜*)♪  ♪(＾∀＾●)ﾉφ(゜▽゜*)♪  ♪(＾∀＾●)ﾉφ(゜▽゜*)♪  ♪(＾∀＾●)ﾉφ(゜▽゜*)♪  ♪(＾∀＾●)ﾉφ(゜▽゜*)♪  ♪(＾∀＾●)ﾉφ(゜▽゜*)♪  ♪(＾∀＾●)ﾉ\n";
print
"\n时光飞逝，很快就到了进京赶考的日子。\n离别前一晚，想起这几日和几位姑娘一同度过的日子，不由心生不舍。\n辗转反侧，你决定去和姑娘告别，但暮色渐晚，你只来得及和一位姑娘告别 'w(ﾟДﾟ)w'，你决定找谁呢？\n\n";
print "A.染七\nB.陆美丽\nC.陆可爱\nD.陆美丽和陆可爱\n\n";
do {
    $choose = '';
    you_choose();
    if ( $choose =~ /[Aa]/ ) {
        print
          " \n❤ ❤ you choose A❤ ❤\nPlease enter 'Enter' to continue.\n";
        countine();
        $qqhgd = $qqhgd + 1;
    }
    elsif ( $choose =~ /[Bb]/ ) {
        print
          "\n❤ ❤ you choose B❤ ❤\nPlease enter 'Enter' to continue.\n";
        countine();
        $mlhgd = $mlhgd + 1;
    }
    elsif ( $choose =~ /[Cc]/ ) {
        print
          "\n❤ ❤ you choose C❤ ❤\nPlease enter 'Enter' to continue.\n";
        countine();
        $kahgd = $kahgd + 1;
    }
    elsif ( $choose =~ /[Dd]/ ) {
        print
          "\n❤ ❤ you choose D❤ ❤\nPlease enter 'Enter' to continue.\n";
        countine();
        $kahgd = $kahgd + 1;
        $mlhgd = $mlhgd + 1;
    }
    else { print "打的什么鬼，请重新输入"; }
} until ( $choose =~ /[ABCDabcd]/ );

#结局 此部分为史梦欣所编写。
print "\n你走入考场……\n";
print "❀ ❀ ❀ ❀ ❀ ❀ ❀ \n";
print "你走出考场……\n";
print "❀ ❀ ❀ ❀ ❀ ❀ ❀ \n";
print "你回到家乡……\n";
print "❀ ❀ ❀ ❀ ❀ ❀ ❀ \n";
print "你收到了成绩……\n";
print "❀ ❀ ❀ ❀ ❀ ❀ ❀ \n";
print "那么，结局如何呢？\n";
print " ……………………最终……………………\n\n";

if ( $mlhgd == 3 && $kahgd == 3 && $qqhgd == 0 ) {
    print
"虽然未能高中状元，但亦是成绩喜人。在朝中做着不大不小的官，虽不能富可敌国，亦是温饱不愁，而且不需要每天察言观色面对官场的腐败。想起在陆府那几日，你不由更为想念陆家姐妹。你去陆府提出想娶二姐妹，陆家姐妹暗喜心意相通。陆老爷差点心脏病发作气死过去，知女莫若父，陆员外看出了自家女儿的心意不忍阻拦，只能默许。妻妾姐妹情深（本来就是姐妹吧！）你们三人幸福的生活在了一起（这是什么鬼啊！）\n\n";
}
elsif ( $mlhgd == 2 && $kahgd == 2 && $qqhgd == 2 ) {
    print
"考试过程中，你心心念着三姐妹，心绪不宁，成绩并不理想。但偶遇贵人推荐，进朝做官。你发现官场的勾心斗角更适合你，你不贪污腐败却走在边缘位置，很快成了大官。偶然一日，想起了当年的三姐妹，便去上门提亲，陆员外并不想应下这门亲事，却不敢得罪身为朝中重臣的你，你愉快的又娶回了三个妾(你是愉快了，姑娘们呢！)\n\n";
}
elsif ( $qqhgd >= 3 ) {
    print
"你发挥正常，高中状元。却发觉官场黑暗，与自己的理想相差甚远。仔细思考后，你决定辞官去游览祖国大好河山，凭你的才学亦是衣食无忧。想起来再陆府的时候和柒七过的那些日子，不由得更为想念柒七，去柒府提起却被柒老爷因为嫌弃没权没势而拒绝。你一个人游历祖国大好河山，很多年后，X秋霞的书画已经千金难求。\n\n";
}
elsif ( $mlhgd >= 3 ) {
    print
"虽然未能高中状元，但亦是成绩喜人。在朝中做着不大不小的官，虽不能富可敌国，亦是温饱不愁，而且不需要每天察言观色面对官场的腐败。想起在陆府那几日，你不由更为想念陆美丽。你去陆府提亲，陆老爷欣喜的答应，你和陆美丽幸福的生活在了一起。\n\n";
}
elsif ( $kahgd >= 3 ) {
    print
"虽然未能高中状元，但亦是成绩喜人。在朝中做着不大不小的官，虽不能富可敌国，亦是温饱不愁，而且不需要每天察言观色面对官场的腐败。想起在陆府那几日，你不由更为想念陆可爱。你去陆府提亲，陆老爷欣喜的答应，你和陆可爱幸福的生活在了一起。\n\n";
}
else {
    print
"你发挥正常，高中状元。却发觉官场黑暗，与自己的理想相差甚远。仔细思考后，你决定辞官去游览祖国大好河山，凭你的才学亦是衣食无忧。很多年后，秋霞的书画已经千金难求。偶尔想起来当年的三个姑娘，不知她们是否已经嫁人。愿她们安好。\n\n";
}
print
  "✲ ✲ ✲ ✲ ✲ 游戏结束，欢迎下次来玩✲ ✲ ✲ ✲ ✲\n";
print "
 .       .         
 \`-'''-'/
  } 6 6 {    
 =.  Y  ,=   
   /^^^\  .
  /     \  )           
 (  )-(  )/
\n";
exit;
